Revit 2027 API
CylindricalSurface.YDir Property
 Y axis of the local coordinate system associated with this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ YDir { get; }
Public ReadOnly Property YDir As XYZ
	Get
public:
property XYZ^ YDir {
	XYZ^ get ();
}
member YDir : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace